import { Container, Grid, Typography } from '@mui/material';
import Image from 'next/image';
import DataImage from '../../../assets/making-image.png';
import { LuncherCard } from '../../molecules';

export default function Industry({
                                   flip,
                                 }) {



  return (
    <Grid id={"industry"} container style={{ padding : '100px 0', background : '#272443' }}>
      <Container >
        <Grid container spacing={3}>
          <LuncherCard
            title={"تصویر سازی داده"}
          desc={"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،\n" +
          "              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،\n" +
          "              و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،\n" +
          "              شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی\n" +
          "              الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری\n" +
          "              موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و\n" +
          "              جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."}
            src={DataImage}
          />
          <div style={{width : '100%',margin : '40px 0'}} />

          <LuncherCard
            flip={true}
            title={"تصویر سازی داده"}
          desc={"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،\n" +
          "              چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،\n" +
          "              و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،\n" +
          "              شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی\n" +
          "              الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری\n" +
          "              موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و\n" +
          "              جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."}
            src={DataImage}
          />
        </Grid>
      </Container>
     </Grid>
  );
}